KurtE/EVKB_1060/src/boards.txt
teensypp2.menu.usb.serial=Serial
teensypp2.menu.usb.serial.build.usbtype=USB_SERIAL
teensypp2.menu.usb.serial.upload_port.usbtype=USB_SERIAL
teensypp2.menu.usb.hid=Keyboard + Mouse + Joystick
teensypp2.menu.usb.hid.build.usbtype=USB_HID
teensypp2.menu.usb.hid.upload_port.usbtype=USB_HID
teensypp2.menu.usb.hid.fake_serial=teensy_gateway
teensypp2.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensypp2.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensypp2.menu.usb.serialhid.upload_port.usbtype=USB_SERIAL_HID
teensypp2.menu.usb.int_disk=Disk(Internal) + Keyboard
teensypp2.menu.usb.int_disk.build.usbtype=USB_DISK
teensypp2.menu.usb.int_disk.upload_port.usbtype=USB_DISK
teensypp2.menu.usb.int_disk.fake_serial=teensy_gateway
teensypp2.menu.usb.int_disk.build.elfpatch=mktinyfat
teensypp2.menu.usb.sd_disk=Disk(SD Card) + Keyboard
teensypp2.menu.usb.sd_disk.build.usbtype=USB_DISK_SDFLASH
teensypp2.menu.usb.sd_disk.upload_port.usbtype=USB_DISK_SDFLASH
teensypp2.menu.usb.sd_disk.fake_serial=teensy_gateway
teensypp2.menu.usb.midi=MIDI
teensypp2.menu.usb.midi.build.usbtype=USB_MIDI
teensypp2.menu.usb.midi.upload_port.usbtype=USB_MIDI
teensypp2.menu.usb.midi.fake_serial=teensy_gateway
teensypp2.menu.usb.rawhid=Raw HID
teensypp2.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensypp2.menu.usb.rawhid.upload_port.usbtype=USB_RAWHID
teensypp2.menu.usb.rawhid.fake_serial=teensy_gateway
teensypp2.menu.usb.flightsim=Flight Sim Controls
teensypp2.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensypp2.menu.usb.flightsim.upload_port.usbtype=USB_FLIGHTSIM
teensypp2.menu.usb.flightsim.fake_serial=teensy_gateway
teensypp2.menu.speed.16=16 MHz
teensypp2.menu.speed.8=8 MHz
teensypp2.menu.speed.4=4 MHz
teensypp2.menu.speed.2=2 MHz
teensypp2.menu.speed.1=1 MHz
teensypp2.menu.speed.16.build.fcpu=16000000L
teensypp2.menu.speed.8.build.fcpu=8000000L
teensypp2.menu.speed.4.build.fcpu=4000000L
teensypp2.menu.speed.2.build.fcpu=2000000L
teensypp2.menu.speed.1.build.fcpu=1000000L

teensypp2.menu.keys.en-us=US English
teensypp2.menu.keys.en-us.build.keylayout=US_ENGLISH
teensypp2.menu.keys.fr-ca=Canadian French
teensypp2.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensypp2.menu.keys.xx-ca=Canadian Multilingual
teensypp2.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensypp2.menu.keys.cz-cz=Czech
teensypp2.menu.keys.cz-cz.build.keylayout=CZECH
teensypp2.menu.keys.da-da=Danish
teensypp2.menu.keys.da-da.build.keylayout=DANISH
teensypp2.menu.keys.fi-fi=Finnish
teensypp2.menu.keys.fi-fi.build.keylayout=FINNISH
teensypp2.menu.keys.fr-fr=French
teensypp2.menu.keys.fr-fr.build.keylayout=FRENCH
teensypp2.menu.keys.fr-be=French Belgian
teensypp2.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensypp2.menu.keys.fr-ch=French Swiss
teensypp2.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensypp2.menu.keys.de-de=German
teensypp2.menu.keys.de-de.build.keylayout=GERMAN
teensypp2.menu.keys.de-dm=German (Mac)
teensypp2.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensypp2.menu.keys.de-ch=German Swiss
teensypp2.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensypp2.menu.keys.is-is=Icelandic
teensypp2.menu.keys.is-is.build.keylayout=ICELANDIC
teensypp2.menu.keys.en-ie=Irish
teensypp2.menu.keys.en-ie.build.keylayout=IRISH
teensypp2.menu.keys.it-it=Italian
teensypp2.menu.keys.it-it.build.keylayout=ITALIAN
teensypp2.menu.keys.no-no=Norwegian
teensypp2.menu.keys.no-no.build.keylayout=NORWEGIAN
teensypp2.menu.keys.pt-pt=Portuguese
teensypp2.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensypp2.menu.keys.pt-br=Portuguese Brazilian
teensypp2.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensypp2.menu.keys.rs-rs=Serbian (Latin Only)
teensypp2.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensypp2.menu.keys.es-es=Spanish
teensypp2.menu.keys.es-es.build.keylayout=SPANISH
teensypp2.menu.keys.es-mx=Spanish Latin America
teensypp2.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensypp2.menu.keys.sv-se=Swedish
teensypp2.menu.keys.sv-se.build.keylayout=SWEDISH
teensypp2.menu.keys.tr-tr=Turkish (partial)
teensypp2.menu.keys.tr-tr.build.keylayout=TURKISH
teensypp2.menu.keys.en-gb=United Kingdom
teensypp2.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensypp2.menu.keys.usint=US International
teensypp2.menu.keys.usint.build.keylayout=US_INTERNATIONAL


teensy2.name=Teensy 2.0
teensy2.upload.maximum_size=32256
teensy2.upload.maximum_data_size=2560
teensy2.upload.tool=teensyloader
teensy2.upload.tool.default=teensyloader
teensy2.upload.tool.teensy=teensyloader
teensy2.upload.protocol=teensy
teensy2.upload_port.modelID=0x1B
teensy2.build.board=TEENSY2
teensy2.build.core=teensy
teensy2.build.mcu=atmega32u4
teensy2.build.warn_data_percentage=80
teensy2.build.toolchain=avr/bin/
teensy2.build.command.gcc=avr-gcc
teensy2.build.command.g++=avr-g++
teensy2.build.command.ar=avr-ar
teensy2.build.command.objcopy=avr-objcopy
teensy2.build.command.objdump=avr-objdump
teensy2.build.command.linker=avr-gcc
teensy2.build.command.size=avr-size
teensy2.build.flags.common=-g -Wall -ffunction-sections -fdata-sections
teensy2.build.flags.dep=-MMD
teensy2.build.flags.optimize=-Os
teensy2.build.flags.cpu=-mmcu=atmega32u4
teensy2.build.flags.defs=-DTEENSYDUINO=159 -DARDUINO_ARCH_AVR
teensy2.build.flags.cpp=-fno-exceptions -fpermissive -felide-constructors -std=gnu++11
teensy2.build.flags.c=
teensy2.build.flags.S=-x assembler-with-cpp
teensy2.build.flags.ld=-Wl,--gc-sections,--relax
teensy2.build.flags.ldspecs=
teensy2.build.flags.libs=-lm
teensy2.build.serial_number=true
teensy2.serial.restart_cmd=true

teensy2.menu.usb.serial=Serial
teensy2.menu.usb.serial.build.usbtype=USB_SERIAL
teensy2.menu.usb.serial.upload_port.usbtype=USB_SERIAL
teensy2.menu.usb.hid=Keyboard + Mouse + Joystick
teensy2.menu.usb.hid.build.usbtype=USB_HID
teensy2.menu.usb.hid.upload_port.usbtype=USB_HID
teensy2.menu.usb.hid.fake_serial=teensy_gateway
teensy2.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy2.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensy2.menu.usb.serialhid.upload_port.usbtype=USB_SERIAL_HID
teensy2.menu.usb.int_disk=Disk(Internal) + Keyboard
teensy2.menu.usb.int_disk.build.usbtype=USB_DISK
teensy2.menu.usb.int_disk.upload_port.usbtype=USB_DISK
teensy2.menu.usb.int_disk.fake_serial=teensy_gateway
teensy2.menu.usb.int_disk.build.elfpatch=mktinyfat
teensy2.menu.usb.sd_disk=Disk(SD Card) + Keyboard
teensy2.menu.usb.sd_disk.build.usbtype=USB_DISK_SDFLASH
teensy2.menu.usb.sd_disk.upload_port.usbtype=USB_DISK_SDFLASH
teensy2.menu.usb.sd_disk.fake_serial=teensy_gateway
teensy2.menu.usb.midi=MIDI
teensy2.menu.usb.midi.build.usbtype=USB_MIDI
teensy2.menu.usb.midi.upload_port.usbtype=USB_MIDI
teensy2.menu.usb.midi.fake_serial=teensy_gateway
teensy2.menu.usb.rawhid=Raw HID
teensy2.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensy2.menu.usb.rawhid.upload_port.usbtype=USB_RAWHID
teensy2.menu.usb.rawhid.fake_serial=teensy_gateway
teensy2.menu.usb.flightsim=Flight Sim Controls
teensy2.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensy2.menu.usb.flightsim.upload_port.usbtype=USB_FLIGHTSIM
teensy2.menu.usb.flightsim.fake_serial=teensy_gateway
teensy2.menu.speed.16=16 MHz
teensy2.menu.speed.8=8 MHz
teensy2.menu.speed.4=4 MHz
teensy2.menu.speed.2=2 MHz
teensy2.menu.speed.1=1 MHz
teensy2.menu.speed.16.build.fcpu=16000000L
teensy2.menu.speed.8.build.fcpu=8000000L
teensy2.menu.speed.4.build.fcpu=4000000L
teensy2.menu.speed.2.build.fcpu=2000000L
teensy2.menu.speed.1.build.fcpu=1000000L

teensy2.menu.keys.en-us=US English
teensy2.menu.keys.en-us.build.keylayout=US_ENGLISH
teensy2.menu.keys.fr-ca=Canadian French
teensy2.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensy2.menu.keys.xx-ca=Canadian Multilingual
teensy2.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensy2.menu.keys.cz-cz=Czech
teensy2.menu.keys.cz-cz.build.keylayout=CZECH
teensy2.menu.keys.da-da=Danish
teensy2.menu.keys.da-da.build.keylayout=DANISH
teensy2.menu.keys.fi-fi=Finnish
teensy2.menu.keys.fi-fi.build.keylayout=FINNISH
teensy2.menu.keys.fr-fr=French
teensy2.menu.keys.fr-fr.build.keylayout=FRENCH
teensy2.menu.keys.fr-be=French Belgian
teensy2.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensy2.menu.keys.fr-ch=French Swiss
teensy2.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensy2.menu.keys.de-de=German
teensy2.menu.keys.de-de.build.keylayout=GERMAN
teensy2.menu.keys.de-dm=German (Mac)
teensy2.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensy2.menu.keys.de-ch=German Swiss
teensy2.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensy2.menu.keys.is-is=Icelandic
teensy2.menu.keys.is-is.build.keylayout=ICELANDIC
teensy2.menu.keys.en-ie=Irish
teensy2.menu.keys.en-ie.build.keylayout=IRISH
teensy2.menu.keys.it-it=Italian
teensy2.menu.keys.it-it.build.keylayout=ITALIAN
teensy2.menu.keys.no-no=Norwegian
teensy2.menu.keys.no-no.build.keylayout=NORWEGIAN
teensy2.menu.keys.pt-pt=Portuguese
teensy2.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensy2.menu.keys.pt-br=Portuguese Brazilian
teensy2.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensy2.menu.keys.rs-rs=Serbian (Latin Only)
teensy2.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensy2.menu.keys.es-es=Spanish
teensy2.menu.keys.es-es.build.keylayout=SPANISH
teensy2.menu.keys.es-mx=Spanish Latin America
teensy2.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensy2.menu.keys.sv-se=Swedish
teensy2.menu.keys.sv-se.build.keylayout=SWEDISH
teensy2.menu.keys.tr-tr=Turkish (partial)
teensy2.menu.keys.tr-tr.build.keylayout=TURKISH
teensy2.menu.keys.en-gb=United Kingdom
teensy2.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensy2.menu.keys.usint=US International
teensy2.menu.keys.usint.build.keylayout=US_INTERNATIONAL




teensyDIY.name=Teensy DIY SDRAM
#teensyDIY.upload.maximum_size=16515072
teensyDIY.build.board=TEENSY_SDRAM
teensyDIY.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/imxrt1062_diy.ld"
#teensyDIY.upload.maximum_data_size=524288
#teensyDIY.upload.maximum_data_size=1048576
teensyDIY.upload.tool=teensyloader
teensyDIY.upload.tool.default=teensyloader
teensyDIY.upload.tool.teensy=teensyloader
teensyDIY.upload.protocol=teensy
teensyDIY.upload_port.modelID=0x26
teensyDIY.build.core=teensy4
teensyDIY.build.mcu=imxrt1062
teensyDIY.build.warn_data_percentage=99
teensyDIY.build.toolchain=arm/bin/
teensyDIY.build.command.gcc=arm-none-eabi-gcc
teensyDIY.build.command.g++=arm-none-eabi-g++
teensyDIY.build.command.ar=arm-none-eabi-gcc-ar
teensyDIY.build.command.objcopy=arm-none-eabi-objcopy
teensyDIY.build.command.objdump=arm-none-eabi-objdump
teensyDIY.build.command.linker=arm-none-eabi-gcc
teensyDIY.build.command.size=arm-none-eabi-size
teensyDIY.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
teensyDIY.build.flags.dep=-MMD
teensyDIY.build.flags.optimize=-Os
teensyDIY.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
teensyDIY.build.flags.defs=-D__IMXRT1062__ -DTEENSYDUINO=159
teensyDIY.build.flags.cpp=-std=gnu++17 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing
teensyDIY.build.flags.c=
teensyDIY.build.flags.S=-x assembler-with-cpp
teensyDIY.build.flags.libs=-larm_cortexM7lfsp_math -lm -lstdc++
teensyDIY.serial.restart_cmd=false
teensyDIY.menu.usb.serial=Serial
teensyDIY.menu.usb.serial.build.usbtype=USB_SERIAL
teensyDIY.menu.usb.serial.upload_port.usbtype=USB_SERIAL
teensyDIY.menu.usb.serial2=Dual Serial
teensyDIY.menu.usb.serial2.build.usbtype=USB_DUAL_SERIAL
teensyDIY.menu.usb.serial2.upload_port.usbtype=USB_DUAL_SERIAL
teensyDIY.menu.usb.serial3=Triple Serial
teensyDIY.menu.usb.serial3.build.usbtype=USB_TRIPLE_SERIAL
teensyDIY.menu.usb.serial3.upload_port.usbtype=USB_TRIPLE_SERIAL
teensyDIY.menu.usb.keyboard=Keyboard
teensyDIY.menu.usb.keyboard.build.usbtype=USB_KEYBOARDONLY
teensyDIY.menu.usb.keyboard.upload_port.usbtype=USB_KEYBOARDONLY
teensyDIY.menu.usb.keyboard.fake_serial=teensy_gateway
teensyDIY.menu.usb.touch=Keyboard + Touch Screen
teensyDIY.menu.usb.touch.build.usbtype=USB_TOUCHSCREEN
teensyDIY.menu.usb.touch.upload_port.usbtype=USB_TOUCHSCREEN
teensyDIY.menu.usb.touch.fake_serial=teensy_gateway
teensyDIY.menu.usb.hidtouch=Keyboard + Mouse + Touch Screen
teensyDIY.menu.usb.hidtouch.build.usbtype=USB_HID_TOUCHSCREEN
teensyDIY.menu.usb.hidtouch.upload_port.usbtype=USB_HID_TOUCHSCREEN
teensyDIY.menu.usb.hidtouch.fake_serial=teensy_gateway
teensyDIY.menu.usb.hid=Keyboard + Mouse + Joystick
teensyDIY.menu.usb.hid.build.usbtype=USB_HID
teensyDIY.menu.usb.hid.upload_port.usbtype=USB_HID
teensyDIY.menu.usb.hid.fake_serial=teensy_gateway
teensyDIY.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensyDIY.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensyDIY.menu.usb.serialhid.upload_port.usbtype=USB_SERIAL_HID
teensyDIY.menu.usb.midi=MIDI
teensyDIY.menu.usb.midi.build.usbtype=USB_MIDI
teensyDIY.menu.usb.midi.upload_port.usbtype=USB_MIDI
teensyDIY.menu.usb.midi.fake_serial=teensy_gateway
teensyDIY.menu.usb.midi4=MIDIx4
teensyDIY.menu.usb.midi4.build.usbtype=USB_MIDI4
teensyDIY.menu.usb.midi4.upload_port.usbtype=USB_MIDI4
teensyDIY.menu.usb.midi4.fake_serial=teensy_gateway
teensyDIY.menu.usb.midi16=MIDIx16
teensyDIY.menu.usb.midi16.build.usbtype=USB_MIDI16
teensyDIY.menu.usb.midi16.upload_port.usbtype=USB_MIDI16
teensyDIY.menu.usb.midi16.fake_serial=teensy_gateway
teensyDIY.menu.usb.serialmidi=Serial + MIDI
teensyDIY.menu.usb.serialmidi.build.usbtype=USB_MIDI_SERIAL
teensyDIY.menu.usb.serialmidi.upload_port.usbtype=USB_MIDI_SERIAL
teensyDIY.menu.usb.serialmidi4=Serial + MIDIx4
teensyDIY.menu.usb.serialmidi4.build.usbtype=USB_MIDI4_SERIAL
teensyDIY.menu.usb.serialmidi4.upload_port.usbtype=USB_MIDI4_SERIAL
teensyDIY.menu.usb.serialmidi16=Serial + MIDIx16
teensyDIY.menu.usb.serialmidi16.build.usbtype=USB_MIDI16_SERIAL
teensyDIY.menu.usb.serialmidi16.upload_port.usbtype=USB_MIDI16_SERIAL
teensyDIY.menu.usb.audio=Audio
teensyDIY.menu.usb.audio.build.usbtype=USB_AUDIO
teensyDIY.menu.usb.audio.upload_port.usbtype=USB_AUDIO
teensyDIY.menu.usb.audio.fake_serial=teensy_gateway
teensyDIY.menu.usb.serialmidiaudio=Serial + MIDI + Audio
teensyDIY.menu.usb.serialmidiaudio.build.usbtype=USB_MIDI_AUDIO_SERIAL
teensyDIY.menu.usb.serialmidiaudio.upload_port.usbtype=USB_MIDI_AUDIO_SERIAL
teensyDIY.menu.usb.serialmidi16audio=Serial + MIDIx16 + Audio
teensyDIY.menu.usb.serialmidi16audio.build.usbtype=USB_MIDI16_AUDIO_SERIAL
teensyDIY.menu.usb.serialmidi16audio.upload_port.usbtype=USB_MIDI16_AUDIO_SERIAL
teensyDIY.menu.usb.mtp=MTP Disk (Experimental)
teensyDIY.menu.usb.mtp.build.usbtype=USB_MTPDISK
teensyDIY.menu.usb.mtp.upload_port.usbtype=USB_MTPDISK
teensyDIY.menu.usb.mtp.fake_serial=teensy_gateway
teensyDIY.menu.usb.serialmtp=Serial + MTP Disk (Experimental)
teensyDIY.menu.usb.serialmtp.build.usbtype=USB_MTPDISK_SERIAL
teensyDIY.menu.usb.serialmtp.upload_port.usbtype=USB_MTPDISK_SERIAL
teensyDIY.menu.usb.rawhid=Raw HID
teensyDIY.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensyDIY.menu.usb.rawhid.upload_port.usbtype=USB_RAWHID
teensyDIY.menu.usb.rawhid.fake_serial=teensy_gateway
teensyDIY.menu.usb.flightsim=Flight Sim Controls
teensyDIY.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensyDIY.menu.usb.flightsim.upload_port.usbtype=USB_FLIGHTSIM
teensyDIY.menu.usb.flightsim.fake_serial=teensy_gateway
teensyDIY.menu.usb.flightsimjoystick=Flight Sim Controls + Joystick
teensyDIY.menu.usb.flightsimjoystick.build.usbtype=USB_FLIGHTSIM_JOYSTICK
teensyDIY.menu.usb.flightsimjoystick.upload_port.usbtype=USB_FLIGHTSIM_JOYSTICK
teensyDIY.menu.usb.flightsimjoystick.fake_serial=teensy_gateway
#teensyDIY.menu.usb.disable=No USB
#teensyDIY.menu.usb.disable.build.usbtype=USB_DISABLED

teensyDIY.menu.speed.600=600 MHz
teensyDIY.menu.speed.528=528 MHz
teensyDIY.menu.speed.450=450 MHz
teensyDIY.menu.speed.396=396 MHz
teensyDIY.menu.speed.150=150 MHz
teensyDIY.menu.speed.24=24 MHz
teensyDIY.menu.speed.720=720 MHz (overclock)
teensyDIY.menu.speed.816=816 MHz (overclock)
teensyDIY.menu.speed.912=912 MHz (overclock, cooling req'd)
teensyDIY.menu.speed.960=960 MHz (overclock, cooling req'd)
teensyDIY.menu.speed.1008=1.008 GHz (overclock, cooling req'd)
teensyDIY.menu.speed.1008.build.fcpu=1008000000
teensyDIY.menu.speed.960.build.fcpu=960000000
teensyDIY.menu.speed.912.build.fcpu=912000000
teensyDIY.menu.speed.816.build.fcpu=816000000
teensyDIY.menu.speed.720.build.fcpu=720000000
teensyDIY.menu.speed.600.build.fcpu=600000000
teensyDIY.menu.speed.528.build.fcpu=528000000
teensyDIY.menu.speed.450.build.fcpu=450000000
teensyDIY.menu.speed.396.build.fcpu=396000000
teensyDIY.menu.speed.150.build.fcpu=150000000
teensyDIY.menu.speed.24.build.fcpu=24000000

