KurtE/EVKB_1060/src/boards.txt
teensyDIY.menu.opt.o2std=Faster
teensyDIY.menu.opt.o2std.build.flags.optimize=-O2
teensyDIY.menu.opt.o2std.build.flags.ldspecs=
teensyDIY.menu.opt.o2lto=Faster with LTO
teensyDIY.menu.opt.o2lto.build.flags.optimize=-O2 -flto -fno-fat-lto-objects
teensyDIY.menu.opt.o2lto.build.flags.ldspecs=-fuse-linker-plugin
teensyDIY.menu.opt.o1std=Fast
teensyDIY.menu.opt.o1std.build.flags.optimize=-O1
teensyDIY.menu.opt.o1std.build.flags.ldspecs=
teensyDIY.menu.opt.o1lto=Fast with LTO
teensyDIY.menu.opt.o1lto.build.flags.optimize=-O1 -flto -fno-fat-lto-objects
teensyDIY.menu.opt.o1lto.build.flags.ldspecs=-fuse-linker-plugin
teensyDIY.menu.opt.o3std=Fastest
teensyDIY.menu.opt.o3std.build.flags.optimize=-O3
teensyDIY.menu.opt.o3std.build.flags.ldspecs=
#teensyDIY.menu.opt.o3purestd=Fastest + pure-code
#teensyDIY.menu.opt.o3purestd.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__
#teensyDIY.menu.opt.o3purestd.build.flags.ldspecs=
teensyDIY.menu.opt.o3lto=Fastest with LTO
teensyDIY.menu.opt.o3lto.build.flags.optimize=-O3 -flto -fno-fat-lto-objects
teensyDIY.menu.opt.o3lto.build.flags.ldspecs=-fuse-linker-plugin
#teensyDIY.menu.opt.o3purelto=Fastest + pure-code with LTO
#teensyDIY.menu.opt.o3purelto.build.flags.optimize=-O3 -mpure-code -D__PURE_CODE__ -flto -fno-fat-lto-objects
#teensyDIY.menu.opt.o3purelto.build.flags.ldspecs=-fuse-linker-plugin
teensyDIY.menu.opt.ogstd=Debug
teensyDIY.menu.opt.ogstd.build.flags.optimize=-Og
teensyDIY.menu.opt.ogstd.build.flags.ldspecs=
#teensyDIY.menu.opt.oglto=Debug with LTO
#teensyDIY.menu.opt.oglto.build.flags.optimize=-Og -flto -fno-fat-lto-objects
#teensyDIY.menu.opt.oglto.build.flags.ldspecs=-fuse-linker-plugin
teensyDIY.menu.opt.osstd=Smallest Code
teensyDIY.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
teensyDIY.menu.opt.osstd.build.flags.ldspecs=
teensyDIY.menu.opt.oslto=Smallest Code with LTO
teensyDIY.menu.opt.oslto.build.flags.optimize=-Os -flto -fno-fat-lto-objects --specs=nano.specs
teensyDIY.menu.opt.oslto.build.flags.ldspecs=-fuse-linker-plugin

teensyDIY.menu.keys.en-us=US English
teensyDIY.menu.keys.en-us.build.keylayout=US_ENGLISH
teensyDIY.menu.keys.fr-ca=Canadian French
teensyDIY.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensyDIY.menu.keys.xx-ca=Canadian Multilingual
teensyDIY.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensyDIY.menu.keys.cz-cz=Czech
teensyDIY.menu.keys.cz-cz.build.keylayout=CZECH
teensyDIY.menu.keys.da-da=Danish
teensyDIY.menu.keys.da-da.build.keylayout=DANISH
teensyDIY.menu.keys.fi-fi=Finnish
teensyDIY.menu.keys.fi-fi.build.keylayout=FINNISH
teensyDIY.menu.keys.fr-fr=French
teensyDIY.menu.keys.fr-fr.build.keylayout=FRENCH
teensyDIY.menu.keys.fr-be=French Belgian
teensyDIY.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensyDIY.menu.keys.fr-ch=French Swiss
teensyDIY.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensyDIY.menu.keys.de-de=German
teensyDIY.menu.keys.de-de.build.keylayout=GERMAN
teensyDIY.menu.keys.de-dm=German (Mac)
teensyDIY.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensyDIY.menu.keys.de-ch=German Swiss
teensyDIY.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensyDIY.menu.keys.is-is=Icelandic
teensyDIY.menu.keys.is-is.build.keylayout=ICELANDIC
teensyDIY.menu.keys.en-ie=Irish
teensyDIY.menu.keys.en-ie.build.keylayout=IRISH
teensyDIY.menu.keys.it-it=Italian
teensyDIY.menu.keys.it-it.build.keylayout=ITALIAN
teensyDIY.menu.keys.no-no=Norwegian
teensyDIY.menu.keys.no-no.build.keylayout=NORWEGIAN
teensyDIY.menu.keys.pt-pt=Portuguese
teensyDIY.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensyDIY.menu.keys.pt-br=Portuguese Brazilian
teensyDIY.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensyDIY.menu.keys.rs-rs=Serbian (Latin Only)
teensyDIY.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensyDIY.menu.keys.es-es=Spanish
teensyDIY.menu.keys.es-es.build.keylayout=SPANISH
teensyDIY.menu.keys.es-mx=Spanish Latin America
teensyDIY.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensyDIY.menu.keys.sv-se=Swedish
teensyDIY.menu.keys.sv-se.build.keylayout=SWEDISH
teensyDIY.menu.keys.tr-tr=Turkish (partial)
teensyDIY.menu.keys.tr-tr.build.keylayout=TURKISH
teensyDIY.menu.keys.en-gb=United Kingdom
teensyDIY.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensyDIY.menu.keys.usint=US International
teensyDIY.menu.keys.usint.build.keylayout=US_INTERNATIONAL





